#### DirectContext3DDocumentUtils Members

---

|  |
| --- |
| DirectContext3DDocumentUtils Class   Methods   See Also |

The  DirectContext3DDocumentUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetDirectContext3DHandleInstances | Returns all DirectContext3D handle instances of the given category in the document. |
| Public method Static member | GetDirectContext3DHandleTypes | Returns all DirectContext3D handle types of the given category in the document. |
| Public method Static member | IsADirectContext3DHandleCategory | Checks whether the provided category ID is one of the categories used by DirectContext3D handle elements. |
| Public method Static member | IsADirectContext3DHandleInstance | Checks whether the provided Element ID corresponds to a DirectContext3D handle instance element. |
| Public method Static member | IsADirectContext3DHandleType | Checks whether the provided Element ID corresponds to a DirectContext3D handle type element. |

# See Also

DirectContext3DDocumentUtils Class

Autodesk.Revit.DB.DirectContext3D Namespace